FV2504/E_0624.dot
digraph D {
    labelloc="t";
    label=<<B><FONT POINT-SIZE="18">GPKE</FONT></B><BR/><BR/><B><FONT POINT-SIZE="16">6.7.3: AD: Lieferbeginn</FONT></B><BR/><BR/><BR/><BR/>>;
    "Start" [margin="0.2,0.12", shape=box, style=filled, fillcolor="#7a8da1", label=<<B>E_0624</B><BR align="center"/><FONT point-size="12"><B><U>Prüfende Rolle:</U> LF</B></FONT><BR align="center"/>>];
    "5" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>5: </B>Ist die Anfrage ausgehend vom ÜT der Lieferanmeldung bis 07:00 Uhr des nächsten Werktages eingegangen?<BR align="left"/>>];
    "A43" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A43</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Fristüberschreitung<BR align="left"/></FONT>>];
    "10" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>10: </B>Wurde der Anwendungsfall für eine verbrauchende Marktlokation verwendet?<BR align="left"/>>];
    "20" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>20: </B>Besteht zum Folgetag des in der Anfrage zur Beendigung der Zuordnung genannten Termins eine Zuordnung für diese Marktlokation?<BR align="left"/>Hinweis: Ist der Kunde in der E/G, ist diese Frage ebenfalls mit ja zu beantworten<BR align="left"/>>];
    "30" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>30: </B>Liegt dem LFA bereits eine bestätigtes Zuordnungsende vor?<BR align="left"/>>];
    "A30" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A30</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Die Belieferung wurde zu dem angefragten Ter-min aus der Anfrage zur Beendigung der Zuordnung bereits beendet und eine Abmeldung von dem LFA bereits versendet, die durch den NB bereits bestätigt wurde.<BR align="left"/></FONT>>];
    "A31" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A31</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Zustimmung<BR align="left"/>Zustimmung der Anfrage zur Beendigung der Zuordnung zum in der bereits versendeten Abmeldung (welche noch nicht beantwortet wurde) genannten Termin.<BR align="left"/></FONT>>];
    "40" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>40: </B>Liegt in der Anfrage zur Beendigung der Zuordnung der Transaktionsgrund Ein-/ Auszug (Umzug) vor?<BR align="left"/>>];
    "50" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>50: </B>Ist der Kunde aus der Anfrage zur Beendigung der Zuordnung identisch mit dem Kunden beim LFA?<BR align="left"/>>];
    "A32" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A32</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Es handelt sich nicht um einen Einzug, da der Kunde aus der Anfrage zur Beendigung der Zuordnung identisch mit dem Kunden beim LFA ist.<BR align="left"/></FONT>>];
    "60" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>60: </B>Hat der LFA Informationen darüber, dass sein Kunde nicht ausgezogen ist?<BR align="left"/>>];
    "A33" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A33</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Der LFA hat die Information, dass der Kunde nicht ausgezogen ist.<BR align="left"/></FONT>>];
    "A34" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A34</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Zustimmung <BR align="left"/>Der LFA beendet die Belieferung und teilt sein Lieferendedatum in der Antwort mit.<BR align="left"/></FONT>>];
    "70" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>70: </B>Ist der LFA ein Lieferant der auch Grundversorger ist?<BR align="left"/>>];
    "80" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>80: </B>Befindet sich die Marktlokation zum Folgetag des Enddatums aus der Anfrage zur Beendigung der Zuordnung in der Ersatz-versorgung?<BR align="left"/>>];
    "A38" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A38</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Zustimmung<BR align="left"/>Ersatzversorgung wurde zum angefragten Termin beendet.<BR align="left"/></FONT>>];
    "90" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>90: </B>Bleibt das Vertragsverhältnis des LFA mit dem Kunden an dieser Marktlokation / Tranchen zum Tag nach dem Enddatum aus der Anfrage zur Beendigung der Zuordnung bestehen?<BR align="left"/>>];
    "A35" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A35</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Es besteht eine Vertragsbindung<BR align="left"/></FONT>>];
    "A36" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A36</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Zustimmung<BR align="left"/>Vertragsverhältnis wurde zum angefragten oder davor liegenden Termin beendet.<BR align="left"/></FONT>>];
    "200" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>200: </B>Besteht zum Folgetag des in der Anfrage zur Beendigung der Zuordnung genannten Termins eine Zuordnung für diese Marktlokation / Tranche?<BR align="left"/>>];
    "210" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>210: </B>Liegt dem LFA bereits eine bestätigtes Zuordnungsende vor?<BR align="left"/>>];
    "A41" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A41</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Die Belieferung wurde zu dem angefragten Ter-min aus der Anfrage zur Beendigung der Zuordnung bereits beendet und eine Abmeldung von dem LFA bereits versendet, die durch den NB bereits bestätigt wurde.<BR align="left"/></FONT>>];
    "A42" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A42</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Zustimmung<BR align="left"/>Zustimmung der Anfrage zur Beendigung der Zuordnung zum in der bereits versendeten Abmeldung (welche noch nicht beantwortet wurde) genannten Termin.<BR align="left"/></FONT>>];
    "220" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>220: </B>Bleibt das Vertragsverhältnis des LFA mit dem Kunden an dieser Marktlokation / Tranche zum Tag nach dem Enddatum aus der Anfrage zur Beendigung der Zuordnung bestehen?<BR align="left"/>>];
    "A39" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A39</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Es besteht eine Vertragsbindung<BR align="left"/></FONT>>];
    "A40" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A40</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Zustimmung<BR align="left"/>Vertragsverhältnis wurde zum angefragten oder davor liegenden Termin beendet.<BR align="left"/></FONT>>];

    "Start" -> "5";
    "5" -> "A43" [label="Nein"];
    "5" -> "10" [label="Ja"];
    "10" -> "200" [label="Nein"];
    "10" -> "20" [label="Ja"];
    "20" -> "40" [label="Ja"];
    "20" -> "30" [label="Nein"];
    "30" -> "A30" [label="Ja"];
    "30" -> "A31" [label="Nein"];
    "40" -> "70" [label="Nein"];
    "40" -> "50" [label="Ja"];
    "50" -> "A32" [label="Ja"];
    "50" -> "60" [label="Nein"];
    "60" -> "A33" [label="Ja"];
    "60" -> "A34" [label="Nein"];
    "70" -> "90" [label="Nein"];
    "70" -> "80" [label="Ja"];
    "80" -> "90" [label="Nein"];
    "80" -> "A38" [label="Ja"];
    "90" -> "A35" [label="Ja"];
    "90" -> "A36" [label="Nein"];
    "200" -> "220" [label="Ja"];
    "200" -> "210" [label="Nein"];
    "210" -> "A41" [label="Ja"];
    "210" -> "A42" [label="Nein"];
    "220" -> "A39" [label="Ja"];
    "220" -> "A40" [label="Nein"];

    bgcolor="transparent";
}
